In [1]:
# Prctice Panadas
import pandas as pd
students = [{"Name":"Inam","Age" : 42},{"Name":"Mohsin","Age" : 26}]
df = pd.DataFrame(students)

In [2]:
df.values

array([[42, 'Inam'],
       [26, 'Mohsin']], dtype=object)

In [3]:
df.keys

<bound method NDFrame.keys of    Age    Name
0   42    Inam
1   26  Mohsin>

In [4]:
df

   Age    Name
0   42    Inam
1   26  Mohsin

In [6]:
df.columns

Index(['Age', 'Name'], dtype='object')

In [7]:
df.Age

0    42
1    26
Name: Age, dtype: int64

In [8]:
df['Age']

0    42
1    26
Name: Age, dtype: int64

In [9]:
student2 = {"Name": ["Inam","Mohsin"], "Age":[42,26]}
df2 = pd.DataFrame(student2)

In [10]:
df2

     Name  Age
0    Inam   42
1  Mohsin   26

In [12]:
# to add a new colume with some value
df['GPA']=3.5

In [13]:
df

   Age    Name  GPA
0   42    Inam  3.5
1   26  Mohsin  3.5